Торговля_11__демо/src/DataProcessors/ПанельАдминистрированияИСМП/ПанельАдминистрированияИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрированияИСМП</name>
</mdclass:DataProcessor>

Торговля_11__демо/src/Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственногоЗаказа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъект</name>
    <type>
      <types>DefinedType.ПроизводственныйОбъектИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдрес</name>
    <comment>Внутренние значения полей адреса доставки (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйОбъектАдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаНачалаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентГосИС</types>
    </type>
  </attributes>
  <attributes>
    <name>БезУчетаНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВвезенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисПровайдер</name>
    <type>
      <types>CatalogRef.СервисПровайдерыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.ИдентификаторЗаявкиИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплатыКодовМаркировки</name>
    <type>
      <types>EnumRef.ТипыОплатыКодовМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСОператором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораСОператором</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидСредстваИдентификации</name>
    <type>
      <types>EnumRef.ВидыСредствИдентификацииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>GLNОрганизации</name>
    <type>
      <types>DefinedType.GLN</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияИзготовленныхКИЗГИСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>DefinedType.GTIN</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <comment>Код товара в ИС МП</comment>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>EnumRef.ШаблоныКодовМаркировкиСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяРозничнаяЦена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаГосИСНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособФормированияСерийногоНомера</name>
      <type>
        <types>EnumRef.СпособыФормированияСерийногоНомераСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПол</name>
      <type>
        <types>EnumRef.ЦелевойПолИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВводаВОборот</name>
      <type>
        <types>EnumRef.СпособыВводаВОборотСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозрастнаяКатегория</name>
      <type>
        <types>EnumRef.ВозрастныеКатегорииИСМП</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьШаблонЭтикетки</name>
      <type>
        <types>CatalogRef.УдалитьШаблоныЭтикетокСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКИЗ</name>
      <type>
        <types>EnumRef.ВидыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>РазмерКИЗ</name>
      <type>
        <types>EnumRef.РазмерыКиЗГИСМ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиВладельца</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Торговля_11__демо/src/DataProcessors/ПанельАдминистрированияИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюРаздельныйКонтрольСтатусовВладельцевКМ(Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюРаздельныйКонтрольСтатусовВладельцевКМ(Параметры) Экспорт
	
	МетаданныеОбъекта  = Метаданные.Константы.ЗапрашиватьДанныеСервисаИСМП;
	ПолноеИмяОбъекта   = МетаданныеОбъекта.ПолноеИмя();
	ОбработкаЗавершена = Истина;
	
	ПредыдущееЗначениеКонтроляСтатусов        = Константы.ЗапрашиватьДанныеСервисаИСМП.Получить();
	ПредыдущееЗначениеКонтроляСтатусовРозница = Константы.УдалитьКонтролироватьСтатусыКодовМаркировкиВРозницеИСМП.Получить();
	
	Если ПредыдущееЗначениеКонтроляСтатусов
		Или ПредыдущееЗначениеКонтроляСтатусовРозница Тогда
		
		ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки       = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки       = Блокировка.Добавить(Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП.ПолноеИмя());
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			НастройкиСканирования = ИнтеграцияИСМПВызовСервера.НастройкиСканированияКодовМаркировки();
		
			ГруппаНастроекКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСервер.ЗначениеГруппыНастроек(
				НастройкиСканирования,
				ПараметрыКонтроля.ПараметрыКонтроляСтатусов);
			ГруппаНастроекКонтрольСтатусов.Включено   = Истина;
			ГруппаНастроекКонтрольСтатусов.Исключения = Новый Соответствие();
			
			ГруппаНастроекКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСервер.ЗначениеГруппыНастроек(
				НастройкиСканирования,
				ПараметрыКонтроля.ПараметрыКонтроляВладельцев);
			ГруппаНастроекКонтрольВладельцев.Включено   = Истина;
			ГруппаНастроекКонтрольВладельцев.Исключения = Новый Соответствие();
			
			УчитываемыеВидыТабак = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(Ложь, Истина);
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка
			|ИЗ
			|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
			|ГДЕ
			|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка.Проведен
			|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.GTIN <> """"
			|	И ПОДСТРОКА(ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.GTIN, 1, 3) <> ""029""
			|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка.ВидПродукции В (&УчитываемыеВидыТабак)";
			
			Запрос.УстановитьПараметр("УчитываемыеВидыТабак", УчитываемыеВидыТабак);
			
			ДобавитьИсключениеКонтрольВладельцевТабакАТП = (Не Запрос.Выполнить().Пустой());
			УчитываемыеВидыМаркируемойПродукции          = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
			ВсеОперации                                  = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций().ВыгрузитьЗначения();
			ВариантОтображенияКонтрольСтатусов           = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
			ВариантОтображенияКонтрольВладельцев         = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
			
			ОперацииИсключений        = Новый Массив();
			ОперацииРозничнойТорговли = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли();
			
			Если ПредыдущееЗначениеКонтроляСтатусов
				И Не ПредыдущееЗначениеКонтроляСтатусовРозница Тогда
				
				ОперацииИсключений                   = ОперацииРозничнойТорговли;
				ВариантОтображенияКонтрольСтатусов   = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				
			ИначеЕсли ПредыдущееЗначениеКонтроляСтатусовРозница
				И Не ПредыдущееЗначениеКонтроляСтатусов Тогда
				
				ОперацииИсключений                   = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВсеОперации, ОперацииРозничнойТорговли);
				ВариантОтображенияКонтрольСтатусов   = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				
			КонецЕсли;
			
			Для Каждого ВидПродукции Из УчитываемыеВидыМаркируемойПродукции Цикл
				
				Для Каждого Операция Из ОперацииИсключений Цикл
					
					НастройкаПараметровСканированияСлужебныйКлиентСервер.ДобавитьВИсключение(
						ГруппаНастроекКонтрольСтатусов,
						ВидПродукции,
						Операция);
					
					НастройкаПараметровСканированияСлужебныйКлиентСервер.ДобавитьВИсключение(
						ГруппаНастроекКонтрольВладельцев,
						ВидПродукции,
						Операция);
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если ДобавитьИсключениеКонтрольВладельцевТабакАТП Тогда
				
				Для Каждого ВидПродукции Из УчитываемыеВидыТабак Цикл
					
					ГруппаНастроекКонтрольВладельцев.Исключения.Вставить(ВидПродукции, Новый Соответствие());
					
				КонецЦикла;
				
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
				
			КонецЕсли;
			
			Если УчитываемыеВидыМаркируемойПродукции.Количество() = 1 Тогда
				Если ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции() Тогда
					ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				КонецЕсли;
				Если ВариантОтображенияКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции() Тогда
					ВариантОтображенияКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				КонецЕсли;
			КонецЕсли;
			
			ГруппаНастроекКонтрольВладельцев.ВариантОтображения = ВариантОтображенияКонтрольВладельцев;
			ГруппаНастроекКонтрольСтатусов.ВариантОтображения   = ВариантОтображенияКонтрольСтатусов;
				
			ЗначениеКонстантыНастроек = Новый ХранилищеЗначения(НастройкиСканирования);
			Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(ЗначениеКонстантыНастроек);
			Константы.ЗапрашиватьДанныеСервисаИСМП.Установить(Истина);
			
			ОбновитьПовторноИспользуемыеЗначения();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОбработкаЗавершена = Ложь;
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать переход на раздельный контроль статусов и кодов макрировки по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,,
			                         ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
